Repository: AnotherFoxGuy/overte-docs-sphinx
Catalog: docs/source/locales/*/LC_MESSAGES/contribute.po
Languages: de, es

source: Contribute
de: Beiträge leisten
es: Contribuir

source: Vircadia is an open-source project, so all of our code and documentation is available for you to look at. You too can contribute to our endeavor for the metaverse! Our main `git repository <https://github.com/vircadia/vircadia>`_ contains the source to many of the components of our software for creating virtual worlds. There are plenty of ways you can contribute to the various parts that make up Vircadia.
de: Vircadia ist ein Open-Source-Projekt, daher steht Ihnen unser gesamter Code und unsere Dokumentation zur Verfügung. Auch Sie können zu unserem Bemühen um das Metaverse beitragen! Unser Haupt-`git-Repository <https://github.com/vircadia/vircadia>`_ enthält die Quelle vieler Komponenten unserer Software zum Erstellen virtueller Welten. Es gibt viele Möglichkeiten, wie Sie zu den verschiedenen Teilen von Vircadia beitragen können.
es: Vircadia es un proyecto de código abierto, por lo que todo nuestro código y documentación está disponible para que lo veas. También puedes contribuir a nuestro esfuerzo para el metaverso! Nuestro `repositorio git <https://github.com/vircadia/vircadia>`_ principal contiene el código fuente de muchos de los componentes de nuestro software para la creación de mundos virtuales. Hay muchas maneras en las que puedes contribuir para ayudar a Vircadia.

source: On This Page
de: Auf dieser Seite
es: En Esta Página

source: Documentation
de: Dokumentation
es: Documentación

source: You can help create and maintain the documentation in several ways:
de: Sie können auf verschiedene Arten bei der Erstellung und Wartung der Dokumentation mithelfen:
es: Puedes ayudar a crear y mantener la documentación de varias formas:

source: Report errors or missing information to the `GitHub issue tracker <https://github.com/vircadia/vircadia-docs-sphinx/issues>`_.
de: Melden Sie Fehler oder fehlende Informationen bei unserer `GitHub Problem Meldung <https://github.com/vircadia/vircadia-docs-sphinx/issues>`_.
es: Reportando errores o ausencia de información en el `seguidor de problemas de Github <https://github.com/vircadia/vircadia-docs-sphinx/issues>`_.

source: Create or change documentation pages and open a `PR (pull request) on GitHub <https://github.com/vircadia/vircadia-docs-sphinx/pulls>`_.
de: Erstellen oder bearbeiten Sie Seiten der Dokumentation, indem Sie eine `PR (pull request) auf GitHub öffnen <https://github.com/vircadia/vircadia-docs-sphinx/pulls>`_ .
es: Crear o modificar paginas de documentación y abrir un `PR (pull request) en GitHub <https://github.com/vircadia/vircadia-docs-sphinx/pulls>`_.

source: `Review changes <https://github.com/vircadia/vircadia-docs-sphinx/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+review">`_ to the documentation on Github. We would like to have two reviewers for most changes, as there are always things that the writer and the first reviewer overlook.
de: `Überprüfen Sie Änderungen <https://github.com/vircadia/vircadia-docs-sphinx/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+review">`_ an der Dokumentation mithilfe von Github. Unser Ziel ist es, für Jede Änderung zwei Überprüfer zu haben, weil es immer Dinge gibt, die der Verfasser und der erste Überprüfer übersehen.
es: `Revisar cambios <https://github.com/vircadia/vircadia-docs-sphinx/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+review">`_ de la documentación en Github. Nos gustaría tener dos revisores para realizar mas cambios, suele pasar que hay cosas que el escritor y el primer revisor pasan por alto.

source: Translation
de: Übersetzung
es: Traducción

source: As an international project, Vircadia relies on translators to be able to reach users that do not speak English. Currently the only component that has translation support is the documentation. You can help translating using our online translation system `Weblate <https://weblate.vircadia.dev>`_ by either submitting translations or becoming a maintainer for your language and checking translations before they make it into the documentation. More information on translating the documentation can be found in its `README <https://github.com/vircadia/vircadia-docs-sphinx/blob/master/README.md>`_.
de: Als ein internationales Projekt, verlässt sich Vircadia auf Übersetzer, um auch Benutzer zu erreichen, die nicht Englisch sprechen. Momentan ist die Dokumentation die einzige Komponente, die eine Übersetzungs Funktion hat. Sie können beim Übersetzen mithelfen, indem sie unser online Übersetzungs System `Weblate <https://weblate.vircadia.dev>`_ benutzen. Sie haben die Möglichkeit neue Übersetzungen einzuspeichern, oder bereits übersetzte Texte auf Fehler zu überprüfen.
es: Como un proyecto internacional, Vircadia confía en traductores para ser capaz de llegar a usuarios que no hablan inglés. Actualmente el único componente que tiene soporte de traducción es la documentación. Puedes ayudar en la traducción usando nuestro sistema de traducción online `Weblate <https://weblate.vircadia.dev>`_ enviando traducciones o convirtiéndote en mantenedor de tú idioma y verificando las traducciones antes de que se incluyan en la documentación.

source: Donations
de: Spenden
es: Donaciones

source: Vircadia is primarily driven by the voluntary contributions of its community and core team. While we do not have an entity to manage donations, you can donate to specific members of the team via various services like PayPal, Patreon, or Github Sponsors.
de: Vircadia wird hauptsächlich finanziert durch Beiträge von freiwilligen und von dem Haupt Team. Da wir keine zentrale Verwaltung für Spenden haben, können Sie Spenden direkt an Team Mitglieder übergeben. Dazu können sie Dienste wie zum Beispiel PayPal, Patreon, oder Github Sponsors verwenden.
es: Vircadia es impulsada principalmente por las contribuciones voluntarias de la comunidad y el equipo núcleo. Si bien aún no contamos con una entidad para gestionar las donaciones, puedes realizar una donación a miembros específicos del equipo por medio de varios servicios como PayPal, Patreon o Sponsors GithHub.

source: You can also put bounties on specific features you want to see implemented or issues you want to see fixed, by leaving a comment on our `issue tracker <https://github.com/vircadia/vircadia/issues>`_. Of course, bounties are also an option for other parts of the project like the documentation. Bounties are created and assigned based on trust, so if you are unsure about something regarding one then speak to a core developer or bring it up at a community or developer meeting. Most of the developers are highly trained and experienced, normally earning upwards of US$40 an hour in the free market. Keep that in mind if you want to see something accomplished that no one else is personally interested in.
de: Sie können auch Prämien anbieten, wenn Sie bestimmte Funktionen implementiert oder Fehler behoben sehen möchten, indem Sie einen Kommentar in unserer `GitHub Problem Meldung <https://github.com/vircadia/vircadia/issues>`_ hinterlassen. Prämien sind natürlich auch eine Option für andere Teile des Projekts wie die Dokumentation. Belohnungen werden auf der Basis von Vertrauen erstellt und vergeben. Wenn Sie Fragen dazu haben, zögern Sie nicht, mit einem Mitglied des Haupt Teams zu sprechen oder sie bei regelmäßigen Community- oder Entwicklertreffen anzusprechen.
es: También puedes otorgar recompensas por funciones específicas que quieres ver implementadas o problemas que quieres que sean solucionados, dejando un comentario en nuestro `seguidor de problemas <https://github.com/vircadia/vircadia/issues>`_. Por supuesto, las recompensas también son una opción para otras partes del proyecto, como la documentación. Las recompensas se crean y asignan en función de la confianza, por lo que si no estás seguro de algo con respecto a una, habla con un desarrollador principal o menciónalo en una comunidad o reunión de desarrolladores. La mayoría de los desarrolladores están altamente capacitados y entrenados, normalmente ganando más de 40 dólares por hora en el mercado libre. Ten en cuenta esto si deseas ver algo hecho en lo que nadie más esté personalmente interesado.

source: Development
de: Entwicklung
es: Desarrollo

source: You can help the general development of the Vircadia project without being a developer yourself by:
de: Sie können bei der allgemeinen Entwicklung von Vircadia mithelfen, ohne ein Software Entwickler zu sein indem Sie:
es: Puedes ayudar el desarrollo general del proyecto Vircadia sin ser un desarrollador tú mismo:

source: filing issues on our `issue tracker <https://github.com/vircadia/vircadia/issues>`_,
de: Fehler oder Bugs bei unserer `GitHub Fehlermeldung <https://github.com/vircadia/vircadia/issues>`_eintragen,
es: Clasificando problemas en nuestro `seguidor de problemas <https://github.com/vircadia/vircadia/issues>`_,

source: helping to narrow down those issues,
de: dabei helfen genauer zu bestimmen, wo der Ursprung dieser Fehler oder Bugs liegt,
es: ayudando a reducir esos problemas,

source: or `testing pull requests <https://github.com/vircadia/vircadia/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+QA+(testing)">`_.
de: Oder indem Sie `pull requests <https://github.com/vircadia/vircadia/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+QA+(testing)">`_testen.
es: o `testeando pull requests <https://github.com/vircadia/vircadia/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+QA+(testing)">`_.

source: If you are a developer, you can contribute directly to the project via pull requests. Keep the `guidelines <https://github.com/vircadia/vircadia/blob/master/CONTRIBUTING.md>`_ in mind when contributing to the main software. Some additional information can be found in the :doc:`Developer Section <developer>`. An important job for developers that have become more accustomed to the platform is `code reviews <https://github.com/vircadia/vircadia/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+CR+(code+review)">`_ of open pull requests.
de: Wenn Sie ein Software Entwickler sind, können Sie direkt mithilfe von pull requests Beiträge leisten. Denken Sie an die `Richtlinien <https://github.com/vircadia/vircadia/blob/master/CONTRIBUTING.md>`_ wenn Sie an der Haupt Software arbeiten. Weitere Informationen finden Sie in der :doc:`Developer Section <developer>`. Ein wichtiger Auftrag der Software Entwickler ist es, `code reviews <https://github.com/vircadia/vircadia/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+CR+(code+review)">`_ von offenen Pull Requests durchzuführen.
es: Si eres un desarrollador, puedes contribuir directamente al proyecto por medio de pull requests. Teniendo las `pautas <https://github.com/vircadia/vircadia/blob/master/CONTRIBUTING.md>`_ en mente cuando contribuyas al software principal. Puedes encontrar información adicional en la :doc:`Sección de Desarrolladores <developer>`. Un trabajo importante para desarrolladores que se ha vuelto más usual en la plataforma son las `revisiones de código <https://github.com/vircadia/vircadia/pulls?q=is%3Apr+is%3Aopen+label%3A"needs+CR+(code+review)">`_ de pull requests abiertos.

source: Miscellaneous Work
de: Weitere Arbeit
es: Trabajos Varios

source: There is also a lot of miscellaneous work that comes up every now and then:
de: Es gibt auch noch viel Arbeit verschiedenster Art, die hier und dort manchmal aufkommt:
es: Hay también mucho trabajo variado que se sube de vez en cuando:

source: 2D art like posters or banners,
de: 2D Kunst wie zum Beispiel Poster oder Banner,
es: Arte 2D como posters o banners,

source: 3D models,
de: 3d Modelle
es: Modelos 3D,

source: scripts,
de: Skripte,
es: Código

source: video editing,
de: Video Bearbeitung,
es: Edición de video

source: and so on.
de: Und so Weiter.
es: etcétera.

source: It is tremendously helpful for developers to have someone that they can ask for assistance when they need work done that is outside their area of expertise.
de: Es ist enorm hilfreich, wenn Software Entwickler jemanden haben, den sie um Unterstützung bitten können, wenn sie Dinge außerhalb ihrer Expertise erledigen müssen.
es: Es tremendamente provechoso para los desarrolladores el tener a alguien a quién ellos pueden pedir ayuda cuando necesitan terminar trabajo que se encuentra fuera de su área de especialización.
