Repository: AnotherFoxGuy/overte-docs-sphinx
Catalog: docs/source/locales/*/LC_MESSAGES/security.po
Languages: de

source: Crash Reporting
de: Absturzberichte

source: Security
de: Sicherheit

source: Security information about the project and its components: Interface, server, and the metaverse server.
de: Sicherheitsinformationen über das Projekt und seine Komponenten: Interface, server, und der metaverse server.

source: Crash Reporting Privacy
de: Datenschutz von Absturzberichten

source: Your interface has crash reporting disabled by default. You can enable/disable this in the **Settings > General** menu. When this is enabled, interface will send a minidump of information to the reporting server that the Vircadia developers have access to. The current crash management server is called [Sentry](https://sentry.io/).
de: Standardmäßig sind Absturzberichte vom Interface deaktiviert. Die kann im Menü **Settings > General** aktiviert/deaktiviert werden. Wenn dies aktiviert ist, sendet das Interface einen Minidump mit Informationen an den Berichtsserver, auf den die Vircadia-Entwickler Zugriff haben. Der aktuelle Absturzmanagement-Server Server heißt [Sentry](https://sentry.io/).

source: Here is [information](https://docs.sentry.io/platforms/native/minidump/#what-is-a-minidump) on what a minidump is and how it's handled by Sentry.
de: Hier befinden sich [Informationen](https://docs.sentry.io/platforms/native/minidump/#what-is-a-minidump) darüber, was ein Minidump ist und wie er von Sentry gehandhabt wird.

source: Here is a list of extra metadata that is collected with a crash report:
de: Im Folgenden befindet sich eine Liste der zusätzlichen Metadaten, die mit einem Absturzbericht erfasst werden:

source: Username
de: Benutzername

source: Domain + location
de: Domäne + Standort

source: Avatar URL
de: URL des Avatar

source: Build type
de: Build-Typ

source: Display plugin
de: Anzeige-Plugin

source: GPU model + GPU memory
de: GPU-Modell + GPU-Speicher

source: Desktop/VR mode
de: Desktop/VR Modus

source: Machine fingerprint
de: Fingerabdruck der Maschine

source: Metaverse session UUID
de: Sitzungs-UUID des Metaversum
